; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image6 - mode
	image3 - mode
	thermograph2 - mode
	infrared5 - mode
	infrared0 - mode
	spectrograph4 - mode
	thermograph7 - mode
	thermograph8 - mode
	infrared9 - mode
	infrared1 - mode
	GroundStation4 - direction
	Star0 - direction
	GroundStation3 - direction
	Star1 - direction
	Star2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 image6)
	(supports instrument1 thermograph8)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument2 thermograph7)
	(supports instrument2 infrared5)
	(supports instrument2 infrared9)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(supports instrument3 image3)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph8)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 Star5)
	(have_image Star5 infrared0)
	(have_image Phenomenon6 thermograph8)
	(have_image Phenomenon7 thermograph8)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon7 image3)
	(have_image Phenomenon8 infrared9)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon8 thermograph8)
	(have_image Planet9 infrared5)
	(have_image Phenomenon10 infrared1)
))

)

; plan
1. (turn_to satellite2 groundstation3 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 12
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite2 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite2 planet9 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet9)
   goals met: 0 of 12
5. (take_image satellite2 planet9 instrument2 infrared5)
   added: (have_image planet9 infrared5)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon8 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon8 instrument2 infrared9)
   added: (have_image phenomenon8 infrared9)
   goals met: 2 of 12
8. (turn_to satellite2 star1 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star1)
   goals met: 2 of 12
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 12
10. (switch_off instrument2 satellite2)
   deleted: (power_on instrument2)
   added: (power_avail satellite2)
   goals met: 2 of 12
11. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 2 of 12
12. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 12
13. (calibrate satellite2 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 2 of 12
14. (turn_to satellite1 phenomenon6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 12
15. (take_image satellite1 phenomenon6 instrument1 thermograph8)
   added: (have_image phenomenon6 thermograph8)
   goals met: 3 of 12
16. (turn_to satellite1 phenomenon7 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 12
17. (take_image satellite1 phenomenon7 instrument1 thermograph8)
   added: (have_image phenomenon7 thermograph8)
   goals met: 4 of 12
18. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 12
19. (take_image satellite1 phenomenon8 instrument1 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 5 of 12
20. (take_image satellite1 phenomenon8 instrument1 thermograph8)
   added: (have_image phenomenon8 thermograph8)
   goals met: 6 of 12
21. (turn_to satellite1 star5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star5)
   goals met: 6 of 12
22. (take_image satellite1 star5 instrument1 infrared0)
   added: (have_image star5 infrared0)
   goals met: 7 of 12
23. (turn_to satellite1 star1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star1)
   goals met: 8 of 12
24. (turn_to satellite2 phenomenon10 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon10)
   goals met: 8 of 12
25. (take_image satellite2 phenomenon10 instrument3 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 9 of 12
26. (turn_to satellite2 phenomenon7 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon7)
   goals met: 9 of 12
27. (take_image satellite2 phenomenon7 instrument3 image3)
   added: (have_image phenomenon7 image3)
   goals met: 10 of 12
28. (take_image satellite2 phenomenon7 instrument3 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 11 of 12
29. (turn_to satellite2 star5 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star5)
   goals met: 12 of 12
